{
  "main": {
    "name":"Rehman Shabab",
    "occupation":"(Computer Science student)",
    "description":"Currently studying my 2nd year in University Of Brighton",
    "image":"profilepic.jpg",
    "bio":"I am athlete by heart, with passion for coding and learning independently. Currently studying BSc (Hons.) Computer Science (2nd year) at University of Brighton. Seeking an internship in the IT industry to build upon a keen scientific interest and start a career as a software engineer. I am interested in software development, web development and designing. I also speak fluent English, Urdu, Hindi, Pashto and Persian. Over the years I have been working on different projects and have successfully developed a web-based CV using React, a Chrome website-blocker and a text based and graphic based games. Learning new things about computers has been my hobby, that is why I go to Codebar to learn current programming. I also work independently on projects, which I find interesting, fun and challenging to do. I have also subscribed to TEDx, MKBHD, and ColdFusion to keep up with the technology.   .",
    "contactmessage":"WARNING: Contact form not yet configured, please contact me via normal email for now",
    "email": "rehman_shabab@yahoo.co.uk",
    "phone": "07505050029",
    "address":{
      "street":"Windermere Court",
      "city":"Brighton",
      "state":"East Sussex",
      "zip": "BN2 0BU"
    },
    "website": "http://www.rehmanshabab.com",
    "resumedownload":"https://drive.google.com/file/d/1YTPWhjrceS-jCQn0HPtc1DZXUE-92m_O/view?usp=sharing",
    "social":[

      {
        "name":"linkedin",
        "url":"https://www.linkedin.com/in/rehman-shabab-887406159/",
        "className":"fa fa-linkedin"
      },

      {
        "name":"twitter",
        "url":"https://twitter.com/Drogo888",
        "className":"fa fa-twitter"
      },

      {
        "name":"instagram",
        "url":"https://stackexchange.com/users/14927196/successfulloser",
        "className":"fa fa-stack-overflow"
      },
      {
        "name":"github",
        "url":"https://github.com/successfullloser",
        "className":"fa fa-github"
      }
    ]
  },
  "resume":{
    "skillmessage":"Have experience in below languages, also working on Vu.js and Heroku.",
    "education":[
      {
        "school":"University of Brighton",
        "degree":"Computer Science BSC",
        "graduated":"Graduation Expected July 2021",
        "description":"Currently I am taking my bachelor’s degree (2nd Year) in University for Brighton. The modules I took last year such as; Embedded Architecture and Programming (Grade A) Developed a traffic light system in both C and Assembly language using Arduino board. Human Computer Interaction (Grade A) Worked in a group to come up with an App idea, presenting the app design, features and security. Programming (Grade A) Developed a working breaking out game, other text-based games, Chrome ad blocker and ATM. Introduction to Requirement Analysis (Grade B) Group work, analysing company data and come up with solutions and how can it be improved. Perspective On Computing (Grade B+) Gained understanding about robots, IOT, Security and Cyber Crime. Group work, we had to prepare a presentation about Volkswagen robot death (2015)."
      },


      {
        "school":"Brighton Metropletein College",
        "degree":"BTEC Extended Diploma",
        "graduated":"2014 - 2016",
        "description":"BTEC Extended Diploma Year 1 & 2 – D* D* D* Accomplished communication skills, both written and verbal, developed through numerous essays. Learned about computer hardware, networking, fixing PCs, replacing computer parts. Proficiency in all areas of Microsoft Office, including Access, Excel, Word and PowerPoint. Visual Basic – used in college to create a working database linked with website. Unity – used in college to create a basic game in Unity."
      },

      {
        "school":"Varndean College",
        "degree":"GCSEs, AS and A Levels",
        "graduated":"2010 - 2013",
        "description":"BTEC ICT Level 2, As, A2 – Distinction. English & Maths – C"
      }

    ],
    "work":[
      {
        "company":"British Heart Foundation (BHF)",
        "title":"Volunteer",
        "years":"April 2015 - June 2017",
        "description":"Worked in British Heart Foundation (BHF) as a volunteer, which have helped me improved my communication skills, interacting skills and working in busy environment. I was also responsible of training new staff members. Learned about serving and Interacting with customers in a busy environment. Gained knowledge about working in groups and helping staff members. Assisted in training new staff members, working quickly to meet objectives during busy periods."
      },
      {
        "company":"Gene Commerce",
        "title":"Volunteer",
        "years":"2016 Feb to 2016 April",
        "description":"Gene Commerce was offering free course for students to learn Programming, For a month I worked with developers in Gene Commerce, to build my website (CV) from scratch using CSS, HTML and JavaScript. I have also worked in British Heart Foundation (BHF) as a volunteer, which have helped me improved my communication skills, interacting skills and working in busy environment. I was also responsible of training new staff members."
      },

      {
        "company":"Laptop Clinic",
        "title":"Technician",
        "years":"March 20015 - July 2015",
        "description":"I was working as a technician, to fix customer PCs, diagnosing, fixing. Learned time management, taking responsibility. Health in safety in work space and Meeting the deadlines and delivering the product on time."
      }
    ],
    "skills":[
      {
        "name":"Java",
        "level":"45%"
      },
      {
        "name":"JavaScript",
        "level":"50%"
      },
      {
        "name":"ReactJs",
        "level":"30%"
      },
      {
        "name":"CSS",
        "level":"60%"
      },
      {
        "name":"HTML5",
        "level":"60%"
      },
      {
        "name":"C & Assembly Language",
        "level":"35%"
      },
      {
        "name":"Illustrator",
        "level":"40%"
      },

      {
        "name":"SQL",
        "level":"55%"
      },

      {
        "name":"Unity",
        "level":"25%"
      }

    ]
  },
  "portfolio":{
    "projects": [
      {
        "title":"Canadian Wanderlust",
        "category":"My Travel Blog for my post-university travels",
        "image":"canadian-wanderlust.jpg",
        "url":"https://www.canadianwanderlust.com"
      },
      {
        "title":"Fury Fighting Gear",
        "category":"(offline now) A fighting gear company I started",
        "image":"fury-fighting-gear.jpg",
        "url":"http://www.timbakerdev.com"
      },
      {
        "title":"Original Thai Food",
        "category":"Website I built for a restaurant I like in Thailand",
        "image":"original-thai-food.jpg",
        "url":"http://www.timbakerdev.com/originalthaifood.github.io"
      },
      {
        "title":"Resume Website",
        "category":"A React based resume website template",
        "image":"resume-website.jpg",
        "url":"http://www.timbakerdev.com"
      },
      {
        "title":"Smirkspace",
        "category":"(MVP Only) A React and Meteor based chat University project.",
        "image":"smirkspace.jpg",
        "url":"http://www.smirkspace.com"
      }
    ]
  },
  "testimonials":{
    "testimonials":[
      {
        "text":"Here you should write some nice things that someone has said about you. No lies though, employers can tell when you are lying.",
        "user":"Kareem Abdul Jabbar"
      },
      {
        "text":"That Rehman Shabab must be one of the most brilliant developers I've ever met! It is amazing that nobody has hired him yet. Hey you, you should hire this guy, he may be fresh out of University and have zero on the job experience but I am confident that he will be one of your best developers in no time!",
        "user":"Steve Wozniak... impersonator"
      }
    ]
  }
}
